#include <stdio.h>
int main()
{
	char a1[210],a2[210];
	int n1[210],n2[210],sum[40000]={0},m=0,n=0,a,b,i,j,k,p,s;
	gets(a1);
    gets(a2);
	while (a1[m])
	{
        n1[m] = a1[m]-'0';
        m++;
    }
    while (a2[n])
	{
        n2[n] = a2[n]-'0';
        n++;
    }
	s=m*n; 
    for (i=m-1,k=0;i>=0;i--,k++)
	{
        a=0,b=0;//进位	临时变量
        for (j=n-1,p=0;j>=0;j--,p++)
		{
            a=n1[i]*n2[j]+b+sum[k+p];
            sum[k+p]=a%10;
            b=a/10;
        }
        if (b>0)
            sum[k+p]=b;
    }
    
	while (sum[s--]==0);
    for (i=s+1;i>=0;i--)
        printf("%d",sum[i]);
    return 0;
}
/*
【问题描述】求两个不超过200位的非负整数的积。

【输入形式】有两行，每行是一个不超过200位的非负整数，没有多余的前导。

【输出形式】一行，即相乘后的结果。结果不能有多余的前导0，即如果结果是342，那么就不能输出为0342。

【样例输入】12345678900

                     98765432100

【样例输出】1219326311126352690000

【样例说明】这两个大整数相乘所得的结果是1219326311126352690000。

【评分标准】本题共4个测试点，每个测试点0.25分，全部通过得1.0分。
*/
