#include<stdio.h>
int main()
{
	int m,n,i=0,a,b,c;
	scanf("%d",&m);
	a=b=m;
	while(a!=0)
	{
		a=a/10;
		i++;
	}
	printf("%d\n",i);
	while(b!=0)
	{
		n=b%10;
		b=b/10;
		printf("%d ",n);
	}
	printf("\n");
	n=0;
	while(m!=0)
	{
		n=n*10+m%10;
		m=m/10;
	}
	c=n;
	while(c!=0)
	{
		n=c%10;
		c=c/10;
		printf("%d ",n);
	}
	return 0;
}
/*【问题描述】对于给定一个不多于5位的正整数，请按以下要求输出结果：①求它是几位数；②分别打印出每一位数字；③按逆序打印出各位数字。例如原数为321，应输出123。

【输入形式】输入一行，一个不多于5位的正整数。

【输出形式】

输出三行。

第一行输出是几位数。

第二行正序输出每一位数字，各个数字间以空格分隔。

第三行逆序输出每一位数字，各个数字间以空格分隔。

【样例输入】12345

【样例输出】

5

1 2 3 4 5

5 4 3 2 1
*/